from dotenv import load_dotenv
import os

load_dotenv()

WEB_SERVER_URL = os.getenv("WEB_SERVER_URL")
MENU_ID = os.getenv("MENU_ID")
TOKEN = os.getenv("TOKEN")
SAVE_PHOTO = os.getenv("SAVE_PHOTO")

DISTH_TYPE = {
    1: "салат",
    2: "суп",
    3: "гарнир",
    4: "овощное блюдо",
    5: "рыбное блюдо",
    6: "блюдо из птицы",
    7: "блюдо из мяса",
    8: "выпечка",
    9: "напиток",
    10: "добавки",
    11: "неопределенное"
}

COUNT_TYPE = {
    1: "порций",
    2: "шт",
    3: "грамм",
    4: "мл",
    11: "порций",
    12: "шт",
    13: "грамм",
    14: "мл",
}

COLORS = {
    0: (0, 100, 0),
    1: (139, 0, 0),
    2: (0, 0, 139),
    3: (255, 255, 0),
    4: (255, 165, 0),
    5: (128, 0, 128),
    6: (127, 255, 0),
    7: (255, 192, 203),
    8: (135, 206, 235),
    9: (230, 230, 250),
    10: (0, 128, 0),
    11: (255, 0, 0),
    12: (0, 0, 255),
    13: (160, 32, 240),
    14: (144, 238, 144),
    15: (255, 127, 80),
    16: (173, 216, 230),
    17: (221, 160, 221),
    18: (0, 160, 0),
    19: (255, 99, 71),
    20: (70, 130, 180),
    21: (186, 85, 211)
}

# Глобальные переменные для размеров окон и элементов
HEIGHT = 640
WIDTH = 1280


